Q1~Q10

In [31]:
import pandas as pd
import numpy as np

df=pd.DataFrame({
    "Menu": ['Americano', 'Latte', 'Espresso', 'Caffe Mocha', 'Vanilla Latte'],
    "Price": [4500, 5000, 4000, 5900, 5300],
    "Calories": [10, 110, np.nan, 210, np.nan],
    "Beans": ["Guatemala", "Brazil", "Guatemala", np.nan, np.nan]
})
df

            Menu  Price  Calories      Beans
0      Americano   4500      10.0  Guatemala
1          Latte   5000     110.0     Brazil
2       Espresso   4000       NaN  Guatemala
3    Caffe Mocha   5900     210.0        NaN
4  Vanilla Latte   5300       NaN        NaN

In [32]:
#Q1.
df['Calories'].fillna(df['Calories'].min(), inplace=True)
df.head()

/var/folders/gx/_f61ngf91hq2y51c1jv2qkkr0000gn/T/ipykernel_74210/636946882.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Calories'].fillna(df['Calories'].min(), inplace=True)

            Menu  Price  Calories      Beans
0      Americano   4500      10.0  Guatemala
1          Latte   5000     110.0     Brazil
2       Espresso   4000      10.0  Guatemala
3    Caffe Mocha   5900     210.0        NaN
4  Vanilla Latte   5300      10.0        NaN

In [33]:
#Q2.
df['Beans']= df['Beans'].fillna(df['Beans'].mode()[0])
df

            Menu  Price  Calories      Beans
0      Americano   4500      10.0  Guatemala
1          Latte   5000     110.0     Brazil
2       Espresso   4000      10.0  Guatemala
3    Caffe Mocha   5900     210.0  Guatemala
4  Vanilla Latte   5300      10.0  Guatemala

In [34]:
#Q3.
df[df['Price']>=5000].shape[0]

3

In [35]:
#Q4.
df["Event"]= df['Price']*0.5
df

            Menu  Price  Calories      Beans   Event
0      Americano   4500      10.0  Guatemala  2250.0
1          Latte   5000     110.0     Brazil  2500.0
2       Espresso   4000      10.0  Guatemala  2000.0
3    Caffe Mocha   5900     210.0  Guatemala  2950.0
4  Vanilla Latte   5300      10.0  Guatemala  2650.0

In [36]:
df['Event'] = df['Event'].astype(int)
df

            Menu  Price  Calories      Beans  Event
0      Americano   4500      10.0  Guatemala   2250
1          Latte   5000     110.0     Brazil   2500
2       Espresso   4000      10.0  Guatemala   2000
3    Caffe Mocha   5900     210.0  Guatemala   2950
4  Vanilla Latte   5300      10.0  Guatemala   2650

In [37]:
#Q5.
df.drop('Calories', axis=1, inplace=True)
df

            Menu  Price      Beans  Event
0      Americano   4500  Guatemala   2250
1          Latte   5000     Brazil   2500
2       Espresso   4000  Guatemala   2000
3    Caffe Mocha   5900  Guatemala   2950
4  Vanilla Latte   5300  Guatemala   2650

In [43]:
#06.
df.loc[:2]

        Menu  Price      Beans  Event
0  Americano   4500  Guatemala   2250
1      Latte   5000     Brazil   2500
2   Espresso   4000  Guatemala   2000

In [45]:
#07.
df.iloc[0:3, :]

        Menu  Price      Beans  Event
0  Americano   4500  Guatemala   2250
1      Latte   5000     Brazil   2500
2   Espresso   4000  Guatemala   2000

In [50]:
#08.
df.loc[1:2, 'Menu':'Price']

       Menu  Price
1     Latte   5000
2  Espresso   4000

In [48]:
#09.
df.iloc[1:3, 0:2]

       Menu  Price
1     Latte   5000
2  Espresso   4000

In [51]:
#10.
df.nlargest(3, "Price")

            Menu  Price      Beans  Event
3    Caffe Mocha   5900  Guatemala   2950
4  Vanilla Latte   5300  Guatemala   2650
1          Latte   5000     Brazil   2500

In [52]:
df.sort_values("Price", ascending=False).head(3)

            Menu  Price      Beans  Event
3    Caffe Mocha   5900  Guatemala   2950
4  Vanilla Latte   5300  Guatemala   2650
1          Latte   5000     Brazil   2500